let ans=document.getElementById('answer');
let se=document.getElementById('select');
let op1=document.getElementById('option1');
let op2=document.getElementById('option2');
let op3=document.getElementById('option3');
let op4=document.getElementById('option4');
let op5=document.getElementById('option5');
let op6=document.getElementById('option6');
let op7=document.getElementById('option7');
let op8=document.getElementById('option8');
let op9=document.getElementById('option9');
let op10=document.getElementById('option10');
let op11=document.getElementById('option11');

function change(e) {
   if (e==op1.value) 
   {
          ans.innerText=
          `
              سنن الوضوء هي: التي يطلب فعلها إضافة إلى أركان الوضوء. وهي: المندوبات والمؤكدات لكن السنن المؤكدة يراد بها عند بعض العلماء «واجبات الوضوء» مثل التسمية، وغسل الكفين. ولها تفاصيل واسعة في كتب الفقه. وأهم سنن الوضوء.
1-التسمية.
غسل الكفين قبل إدخالهما في الإناء.
المضمضة وهي: إدارة الماء في الفم (غسل الفم). وهي واجبة عند الحنابلة.
الاستياك وهو: استعمال السواك عند غسل الفم. (وهو مستحب وليس واجباً)
الاستنشاق، وهو: جذب الماء في الأنف. وهو واجب عند الحنابلة.
الاستنثار: وهو إخراج الماء من الأنف.
مسح الأذنين ظاهرا وباطنا، ومسح الصماخين بماء آخر. «الصماخ: فتحة الأذن (المشتملة على الشمع)»
التثليث: في أفعال الوضوء بغسل اليدين ثلاث مرات والوجه ثلاثا والأقدام ثلاثاً بدءاً من الطرف الايمن ومنهياً بالايسر
، وباقي الأفعال في كل ثلاثا ثلاثا. ما عدى شعر الرأس والأذنين.
مسح جميع الرأس بدءاً بمقدمه.
الاقتصاد في الماء.
هناك سنن أخرى، مذكورة في كتب الفقه.
          `; 
   }
  //  *****************1***************
   else if (e==op2.value) 
   {
          ans.innerText=
          `
          قالت دار الإفتاء إنه لا يجوز لمس المصحف بدون طهارة؛ ويستثني من ذلك أصحاب الأعذار كمن به سلس بول؛ ويحتاج لقراءة القرآن.

          أوضحت الدار عبر الفيسبوك أنه من المقرر شرعًا أنه لا يجوز لمس المصحف بدون طهارة؛ لقول الله تعالى: ﴿لا يَمَسُّهُ إِلا الْمُطَهَّرُونَ﴾ [الواقعة: 79]؛ وهذا عند جمهور الفقهاء، وأجاز ابن عباس رضي الله عنه والشعبي والظاهرية ومن وافقهم للمحدث سواء أكان حدثه حدثا أصغر أو أكبر أن يمس المصحف دون طهارة؛ وعليه فلا بأس لمن كان هذا حاله أن يقلِّد من أجاز من العلماء.
          `;
   }
   //  ****************2****************
   else if (e==op3.value) 
   {
          ans.innerText=
          `
                 يكون الوضوء مستحباً ومندوباً في الأحوال الآتية:[٦]
                 عند قراءة القرآن من غير لمس للمصحف،
                 وعند ذكر الله تعالى. عند كل صلاة ما لم ينتقض وضوءه،
                 فإعادة الوضوء لكل وقت صلاة مستحبٌّ.
                 عند النوم، فيستحب للمسلم أن يتوضأ قبل أن ينام فينام على طهارة، وبهذا كان يوصي النبي الكريم صلى الله عليه وسلم صحابته الكرام.
          `;
   }
     //  **************3******************
   else if (e==op4.value) 
   {
          ans.innerText=
          `
          إن للصلاة عدداً من الشروط التي لا بد أن تتوفر حتى تُعتبر الصلاة صحيحةً شرعاً، وهي:[١] 
          الإسلام: فغير المسلم إن صلى فصلاته غير صحيحة.
           العقل: وهو ضد الجنون، فالمجنون غير مُكلَّفٍ شرعاً، وإن صلَّى فلا تصح صلاته. 
           التمييز: وهو عكس الصغر، ويُصبح الصغير مميزاً إذا أصبح عُمُره سبع سنوات، فيؤمر حينها بالصلاة.
            رفع الحدث: وهو الوضوء المعروف. إزالة النجاسة من البدن والثوب.
             ستر العورة: فلا تصح الصلاة إذا كانت العورة مكشوفة، وحدود عورة الرجل في الصلاة من السرة إلى الركبة، وأما المرأة فكلها عورة إلا وجهها وكفيها.
              دخول وقت الصلاة.
               استقبال القبلة.
                النية: ومكانها في القلب.
          `;
   }
     //  **************4******************   
   else if (e==op5.value) 
   {
          ans.innerText=
          `
          جاءت الأدلة الصحيحة الصريحة على وجوب صلاة الجماعة على الرجال، حيث يقول الله لنبيه -صلى الله عليه وسلم- وهو في ساحة القتال: {وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ}،[١٠] فهذا كان في حال الحرب، وحال السلم أولى وأوجب.[١١]
          `;
   }
     //  **************5******************   
   else if (e==op6.value) 
   {
          ans.innerText=
          `
          أركان الصلاة أربعة عشر وهي: القيام مع القدرة، وتكبيرة الإحرام، وقراءة الفاتحة، والركوع، والرفع منه، والسجود على الأعضاء السبعة، والاعتدال منه، والجلسة بين السجدتين، والطمأنينة في جميع الأركان، والترتيب، والتشهد الأخير، والجلوس له، والصلاة على النبي، والتسليمتان.[١٢]
          `;
   }
     //  ***************6*****************  
     
     else if (e==op7.value) 
     {
            ans.innerText=
            `إن ترك الصلاة عمداً من أكبر الكبائر، لقول النبي -صلى الله عليه وسلم-: (الْعَهْدُ الَّذِي بَيْنَنَا وَبَيْنَهُمْ الصَّلَاةُ فَمَنْ تَرَكَهَا فَقَدْ كَفَرَ)،[٧] وقوله -صلى الله عليه وسلم-: (بَيْنَ الرَّجُلِ وَبَيْنَ الشِّرْكِ أَوْ الْكُفْرِ تَرْكُ الصَّلَاةِ).[٨][٩]`
            ;
     }
       //  ***************7***************** 
       
       else if (e==op8.value) 
       {
              ans.innerText=
              `
              لأركان هي الأمور التي لا يتم الحج ولا يصح إلا بفعلها وهي خمسة: الإحرام، والوقوف، والطواف بعد الوقوف، والسعي بعد أي طواف كان، وإزالة شعر الرأس أو بعضه بالحلق أو التقصير.[١]
              `;
       }
         //  ***************8*****************  

         else if (e==op9.value) 
         {
                ans.innerText=
                `لا يجب على المرأة المنقبة لبس النقاب وهو ما تستر به وجهها منقوباً لعينيها فيه ولا تلبس البرقع أيضاً، والسنة أن تكشف وجهها إلا أن يراها رجال غير محارم لها فيجب عليها ستره في حال الإحرام وغيرها.[٤]`
                ;
         }
           //  ***************9*****************  

           else if (e==op10.value) 
           {
                  ans.innerText=
                  `
                  للحج فضائل عديدة، منها:[٥] هو من أفضل الأعمال والقربات عند الله. الحج يعدل الجهاد في سبيل الله، وينوب عنه لمن لا يقدر عليه ومن لا يكلف به. الحج المبرور ليس له ثواب إلا الجنة. سبب لغفران الذنوب. الإكثار من الحج والعمرة ينفيان الفقر. الحاج وافد على الله، ومن وفد على الله أكرمه الله.
                  `
                  ;
           }
             //  ***************10*****************  

             else if (e==op11.value) 
             {
                    ans.innerText=
                    `
                    إذا أحرم الرجل حرم عليه بإحرامه فعلُ سبعة أمور متعمداً، ومحظورات الإحرام هي:[١] اللباس: فيحرم على المُحرم أن يلبس لباساً مَخيطاً مُحيطاً بجسده، ويجوز له فقط أن يعقد الإزار ويجعل له خيطاً يشده به، ولا يجوز له لبس الخف والجوارب، ويجوز له أن يلبس النعلين. الطيب: فيحرم عليه أن يضع الطيب، وهو العطر، فلا يضعه على ثوبه ولا على بدنه ولا في طعامه، ويحرم عليه أن يشمَّه متعمداً. دهن الشعر: فلا يجوز له أن يدهن شعر رأسه ولحيته بالزيت وما شابههُ، ولا أن يقوم بخضابها، ويجوز له دهن جسده فقط، وكما يجوز له تسريح شعره ولحيته ما لم يؤدِّ ذلك إلى قطع الشعر، ويجوز له أن يحك رأسه وجسده بيده وغيرها، ويجوز له أن يكتحل بكحل لا طيب فيه. إزالة الشعر وقص الأظافر: فلا يجوز للمحرم إزالة من الرأس أو اللحية أو الجسد، سواءً بالحلق أو النتف أو الإحراق، ويجوز له أن يحتجم ما لم يؤد إلى قطع الشعر، ولا يجوز له تقليم الأظافر وقصها. الزواج: إيجاباً وقبولاً فهو حرام في الحج ومفسدٌ له، ولا ينعقد. مقدمات الجماع: كالقبلة واللمس والمعانقة. الصيد: فلا يجوز قتل الصيد أثناء الإحرام، وهو أمرٌ محرم في الحج، ولا يجوز أخذ أي جزء من الحيوان أيضاً كالريش وغيره.
                    `
                    ;
             }
               //  ***************11*****************  

}